app/controllers/incidents_controller.rb

SELECT COUNT(*) FROM `incidents` WHERE `incidents`.`technology` = 'wintel'
SELECT `incidents`.* FROM `incidents` WHERE `incidents`.`technology` = 'wintel'
SELECT `incidents`.* FROM `incidents` WHERE `incidents`.`technology` = 'wintel' ORDER BY `incidents`.`id` ASC LIMIT 1 OFFSET 0
---
  def generate_report
    @data = Incident.where(:technology => params["report_name"]).page(params[:page]).per(10)
    @error_msg = "No Data Found..!!!" if @data.blank?